app/views/project/show.html.erb

						<span id="average_rating"></span>
						<span><%= @project.average_rating%><%= @reviews.count %> <%= @reviews.count > 1? "Reviews" : "Review"%></span>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."project_id" = ?  [["project_id", 2]]