app/controllers/charges_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 1], ["user_id", 1], ["created_at", "2018-11-27 17:57:07.861857"], ["updated_at", "2018-11-27 17:57:07.861857"]]
---
	def free
		project = Project.find(params[:project_id])
		current_user.subscriptions.create(project: project)