app/controllers/project_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? ORDER BY "tasks"."tag" ASC  [["project_id", 3]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 2]]
SELECT  1 AS one FROM "projects" INNER JOIN "subscriptions" ON "projects"."id" = "subscriptions"."project_id" WHERE "subscriptions"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" INNER JOIN "subscriptions" ON "users"."id" = "subscriptions"."user_id" WHERE "subscriptions"."project_id" = ? ORDER BY created_at LIMIT ?  [["project_id", 4], ["LIMIT", 10]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."project_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["project_id", 4], ["user_id", 1], ["LIMIT", 1]]
---
  def show
  	@project=Project.find(params[:id])
  	@tasks=@project.tasks.order(:tag)
  	@joined=false
  	 if !current_user.nil? && !current_user.projects.nil?
  	 	@joined= current_user.projects.include?(@project)
  	 end
  	 @users=@project.users.order('created_at').first(10)
     @review=Review.new
     @reviews=@project.reviews

     @hasReview=@reviews.find_by(user_id: current_user.id) if current_user