app/controllers/reviews_controller.rb

	def create
		@review =Review.create(review_params)
---
INSERT INTO "reviews" ("project_id", "user_id", "comment", "created_at", "star", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["project_id", 1], ["user_id", 1], ["comment", "Pakistan"], ["created_at", "2018-11-27 17:58:23.536571"], ["star", 5], ["updated_at", "2018-11-27 17:58:23.536571"]]

	def destroy
		@review=Review.find(params[:id])
		project=@review.project
		@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]