app/models/task.rb

    def next
    	project.tasks.where("tag > ? AND header = ? ",tag,false).order(:tag).first
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND (tag > NULL AND header = FALSE ) ORDER BY "tasks"."tag" ASC LIMIT $2  [["project_id", 1], ["LIMIT", 1]]

    def prev
    	project.tasks.where("tag < ? AND header = ? ",tag,false).order(:tag).last
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND (tag < NULL AND header = FALSE ) ORDER BY "tasks"."tag" DESC LIMIT $2  [["project_id", 1], ["LIMIT", 1]]